const dictPattern = {
  email: {
    regexp:
      /^([a-zA-Z0-9]+[-_.]*[a-zA-Z0-9]+|[a-zA-Z0-9]+)@[-a-zA-Z0-9]+\.[a-zA-Z.]{2,}$/,
    errorText: 'от 3 до 20 символов, латиница, цифры, - _',
  },
  login: {
    regexp: /^[a-z0-9-_]{3,20}$/i,
    errorText: 'от 3 до 20 символов, латиница, цифры, - _',
  },
  first_name: {
    regexp: /([A-ЯËA-Z][а-яёa-z]+)(-[А-ЯËA-Z][а-яёa-z]+)?/,
    errorText: 'латиница или кириллица, первая буква заглавная',
  },
  second_name: {
    regexp: /([A-ЯËA-Z][а-яёa-z]+)(-[А-ЯËA-Z][а-яёa-z]+)?/,
    errorText: 'латиница или кириллица, первая буква заглавная',
  },
  phone: {
    regexp: /^[+]?[\d]{10,15}/,
    errorText: 'введите телефон',
  },
  password: {
    regexp: /(?=.*[0-9])(?=.*[a-z])(?=.*[A-Z])[0-9a-zA-Z!@#$%^&*]{8,40}/g,
    errorText:
      'от 8 до 40 символов, обязательно хотя бы одна заглавная буква и цифра',
  },
  password1: {
    regexp: /(?=.*[0-9])(?=.*[a-z])(?=.*[A-Z])[0-9a-zA-Z!@#$%^&*]{8,40}/g,
    errorText:
      'от 8 до 40 символов, обязательно хотя бы одна заглавная буква и цифра',
  },
}

export default dictPattern
